Revit 2027 API
NumberingSchema.GetNumberingSchema(Document, String) Method
 Returns an instance of the specified Numbering Schema in the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static NumberingSchema GetNumberingSchema(
	Document document,
	string schemaName
)
Public Shared Function GetNumberingSchema (
	document As Document,
	schemaName As String
) As NumberingSchema
public:
static NumberingSchema^ GetNumberingSchema(
	Document^ document,
	String^ schemaName
)
static member GetNumberingSchema :
        document : Document *
        schemaName : string -> NumberingSchema
Parameters
document Document
 A document to get the numbering schema from.
schemaName String
 The name of a schema to get.
Return Value
NumberingSchema
 Instance of the specified schema.
Exceptions
Exception | Condition
ArgumentException |  The given schemaName has is invalid or allready in use.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
GetNumberingSchema Overload
Autodesk.Revit.DB Namespace